app/Controllers/AuthController.php

SELECT *
FROM `Customer`
WHERE `username` = 'customer1'
 LIMIT 1
---
    public function loginAuth()
    {
        $session = session();
        $customerModel = new Customer();
        $username = $this->request->getVar('username');
        $password = md5($this->request->getVar('password'));

        $data = $customerModel->where('username', $username)->first();