app/Models/Customer.php

    public function getDataCustomer() {
        return $this->findAll();
---
SELECT *
FROM `Customer`