app/Models/DetailPemesanan.php

SELECT `DetailPemesanan`.`id`, `DetailPemesanan`.`namaMakanan`, `DetailPemesanan`.`harga`, `DetailPemesanan`.`jumlah`, (DetailPemesanan.harga * DetailPemesanan.jumlah) as hargaPesanan
FROM `DetailPemesanan`
WHERE `DetailPemesanan`.`orderId` = 4
---
    public function getDetailPemesanan($orderId)
    {
        $db      = \Config\Database::connect();
        $builder = $db->table('DetailPemesanan');

        $builder->select('DetailPemesanan.id, DetailPemesanan.namaMakanan, DetailPemesanan.harga, DetailPemesanan.jumlah, (DetailPemesanan.harga * DetailPemesanan.jumlah) as hargaPesanan');
        $builder->where('DetailPemesanan.orderId', (int)$orderId);

        $query = $builder->get();